//保费测算调整项

export const PremiumConditionMap = {
  1: [
    "年龄",
    {
      title: "性别:",
      type: "gender",
      options: [
        {label: "男", value: "0"},
        {label: "女", value: "1"},
      ]
    },
  ],
  2: [
    "年龄",
    {
      title: "性别:",
      type: "gender",
      options: [
        {label: "男", value: "0"},
        {label: "女", value: "1"},
      ]
    },
    {
      title: "保障:",
      type: "quota", 
      options: [
        {label: "100万，保至60岁", value: "100"},
        {label: "50万，保20年", value: "50"},
      ]
    },
  ],
  3: [
    "年龄",
    {
      title: "性别:",
      type: "gender",
      options: [
        {label: "男", value: "0"},
        {label: "女", value: "1"},
      ]
    },
    {
      title: "社保:",
      type: "social",
      options: [
        {label: "有", value: "1"},
        {label: "无", value: "0"},
      ]
    },
  ],
  4: [
    "年龄",
    {
      title: "保障计划:",
      type: "quota", 
      options: [
        {label: "10万", value: "10"},
        {label: "20万", value: "20"},
        {label: "50万", value: "50"},
        {label: "100万", value: "100"},
      ]
    },
  ],
  6: [
    "年龄",
    {
      title: "性别:",
      type: "gender",
      options: [
        {label: "男", value: "0"},
        {label: "女", value: "1"},
      ]
    },
  ],
}

//保费测算字段
export const PremiumMap = {
  //重疾险
  1: [
    "被保人",
    "保障期间",
    "交费期间",
    "保额",
    "首年保费",
    "总保费",
  ],
  //寿险
  2: [
    "被保人",
    "保障期间",
    "交费期间",
    "保额",
    "首年保费",
  ],
  //医疗险
  3: [
    "被保人",
    "保额",
    "社保",
    "首年保费",
  ],
  //意外险
  4: [
    "被保人",
    "保障计划",
    "首年保费",
  ],
  //年金险
  5: [],
  //防癌险
  6: [
    "被保人",
    "保障期间",
    "交费期间",
    "保额",
    "首年保费",
    "总保费",
  ],
}

//投保规则字段
export const RulesMap = {
  1: [
    "投保年龄",
    "保障期间",
    "最长交费期间",
    "等待期",
    "投保职业",
    "智能核保",
  ],
  2: [
    "投保年龄",
    "最高保额",
    "保障期间",
    "最长交费期间",
    "等待期",
    "适用职业",
    "免责条框",
    "健康告知",
    "是否吸烟",
    "收入要求",
  ],
  3: [
    "投保年龄",
    "保障期间",
    "交费期间",
    "等待期",
    "适用职业",
    "智能核保",
    "保证续保",
    "保证续保期",
    "共享免赔额",
  ],
  4: [
    "投保年龄",
    "保障期间",
    "交费期间",
    "适用职业",
    "生效时间",
    "年收入要求",
  ],
  5: [],
  6: [
    "投保年龄",
    "保障期间",
    "最长交费期间",
    "等待期",
    "适用职业",
  ]
}

export const productSettingsMap = {

  // 重疾险
  1: [
    {
      name: "重疾保障",
      TitleList: [
        // "种类",
        "首次赔付比例",
        "赔付次数",
        "赔付间隔",
        "病种分组",
        "保障特色",
      ]     
    },
    {
      name: "中症保障",
      TitleList: [
        // "种类",
        "首次赔付比例",
        "赔付次数",
        "赔付间隔",
        "病种分组",
        "保障特色",
      ]     
    },
    {
      name: "轻症保障",
      TitleList: [
        // "种类",
        "首次赔付比例",
        "赔付次数",
        "赔付间隔",
        "病种分组",
        "保障特色",
      ]     
    },
    {
      name: "其他保障",
      TitleList: [
        "身故",
        "被保人豁免",
        "投保人豁免",
        "满期返还",
        "其他",
      ]     
    },
  ],

  // 寿险
  2: [
    {
      name: "寿险保障",
      TitleList: [
        "疾病/意外身故保额",
        "全残",
      ]
    },
    {
      name: "其他保障",
      TitleList: [
        "其他保障"
      ]
    },
  ],
  
  //医疗险
  3: [
    {
      name: "一般住院保障",
      TitleList: [
        "住院保额",
        "免赔额",
        "住院日数限制",
        "报销范围",
        "最高报销比例",
        "住院津贴",
      ]
    },
    {
      name: "重疾住院保障",
      TitleList: [
        "住院保额",
        "免赔额",
        "重疾种类",
        "癌症确诊费用",
        "住院日数限制",
        "报销范围",
        "最高报销比例",
        "住院津贴",
      ]
    },
    {
      name: "普通门诊保障",
      TitleList: [
        "门诊保障",
        "免赔额",
        "单次/日限制",
        "报销范围",
        "最高报销比例",
      ]
    },
    {
      name: "其他门诊保障",
      TitleList: [
        "特殊门诊",
        "手术门诊",
        "住院前后门诊",
      ]
    },
    {
      name: "其他保障",
      TitleList: [
        "外购药物",
        "质子重离子",
        "特需医疗",
        "赴外医疗",
        "其他",
      ]
    },
    {
      name: "增值服务保障",
      TitleList: [
        "就医绿通",
        "费用垫付",
        "其他",
      ]
    },
    {
      name: "续保规则保障",
      TitleList: [
        "保证续保期",
        "最高续保年龄",
        "理赔后续保",
        "停售续保",
        "患原位癌后",
        "患癌症后",
      ]
    },
  ],
  
  //意外险
  4: [
    {
      name: "意外伤害保障",
      TitleList: [
        "最高身故保额",
        "最高伤残保额",
        "伤残赔付比例",
      ]
    },
    {
      name: "特定意外额外赔付保障",
      TitleList: [
        "航空",
        "轨道列车",
        "轮船",
        "私家车",
        "公共汽车",
        "网约汽车",
      ]
    },
    {
      name: "意外医疗保障",
      TitleList: [
        "最高保额",
        "免赔额",
        "报销范围",
        "最高报销比例",
        "意外住院津贴",
        "免赔天数",
      ]
    },
    {
      name: "其他保障",
      TitleList: [
        "猝死",
        "满期返还",
        "监护人责任",
        "其他",
      ]
    },
  ],

  //年金险
  5: [],
  
  //防癌险
  6: [
    {
      name: "恶性肿瘤保障",
      TitleList: [
        "癌症保额",
        "原位癌保额",
        "原位癌豁免",
        "特定癌症保额",
        "特定癌症种类",
        "特定癌症轻症保额",
        "特定癌症轻症种类",
        "癌症多次赔付",
        "赔付间隔"
      ]
    },
    {
      name: "其他保障",
      TitleList: [
        "身故",
        "满期返还",
        "其他",
      ]
    },
  ]
}

export const productReviewMap = [
  "亮点",
  "不足",
  "注意事项",
  "适合人群",
  "综合点评",
]