export const PremiumMap = {
  1: [
    "被保人",
    "保额",
    "社保",
    "首年保费",
  ],
  2: [
    "被保人",
    "保障期间",
    "交费期间",
    "保额",
    "首年保费",
    "总保费",
  ]
}

export const RulesMap = {
  1: [
    "投保年龄",
    "保障期间",
    "最长交费期间",
    "等待期",
    "投保职业",
    "智能核保"
  ],
  2: [
    "投保年龄",
    "保障期间",
    "交费期间",
    "等待期",
    "适用职业",
    "智能核保",
    "保证续保",
    "保证续保期",
    "共享免赔额",
  ]
}

export const productSettingsMap = {

  // 重疾险
  1: [
    "重疾保障",
    "中症保障",
    "轻症保障",
    "其他保障",
  ],

  // 寿险
  2: [
    "寿险保障",
    "其他保障"
  ],
  
  //医疗险
  3: [
    {
      name: "一般住院保障",
      TitleList: [
        "住院保额",
        "免赔额",
        "住院日数限制",
        "报销范围",
        "最高报销比例",
        "住院津贴",
      ]
    },
    {
      name: "重疾住院保障",
      TitleList: [
        "住院保额",
        "免赔额",
        "重疾种类",
        "癌症确诊费用",
        "住院日数限制",
        "报销范围",
        "最高报销比例",
        "住院津贴",
      ]
    },
    {
      name: "普通门诊保障",
      TitleList: [
        "门诊保障",
        "免赔额",
        "单次/日限制",
        "报销范围",
        "最高报销比例",
      ]
    },
    {
      name: "其他门诊保障",
      TitleList: [
        "特殊门诊",
        "手术门诊",
        "住院前后门诊",
      ]
    },
    {
      name: "其他保障",
      TitleList: [
        "外购药物",
        "质子重离子",
        "特需医疗",
        "赴外医疗",
        "其他",
      ]
    },
    {
      name: "增值服务保障",
      TitleList: [
        "就医绿通",
        "费用垫付",
        "其他",
      ]
    },
    {
      name: "续保规则保障",
      TitleList: [
        "保证续保期",
        "最高续保年龄",
        "理赔后续保",
        "停售续保",
        "患原位癌后",
        "患癌症后",
      ]
    },
  ],
  
  //意外险
  4: [
    {
      name: "意外伤害保障",
      TitleList: [
        "最高身故保额",
        "最高伤残保额",
        "伤残赔付比例",
      ]
    },
    {
      name: "特定意外额外赔付保障",
      TitleList: [
        "航空",
        "轨道列车",
        "轮船",
        "私家车",
        "公共汽车",
        "网约汽车",
      ]
    },
    {
      name: "意外医疗保障",
      TitleList: [
        "最高保额",
        "免赔额",
        "报销范围",
        "最高报销比例",
        "意外住院津贴",
        "免赔天数",
      ]
    },
    {
      name: "其他保障",
      TitleList: [
        "猝死",
        "满期返还",
        "监护人责任",
        "其他",
      ]
    },
  ],
  5: [],
  
  //防癌险
  6: [
    {
      name: "恶性肿瘤保障",
      TitleList: [
        "癌症保额",
        "原位癌保额",
        "原位癌豁免",
        "特定癌症保额",
        "特定癌症种类",
        "特定癌症轻症保额",
        "特定癌症轻症种类",
        "癌症多次赔付",
        "赔付间隔"
      ]
    },
    {
      name: "其他保障",
      TitleList: [
        "身故",
        "满期返还",
        "其他",
      ]
    },
  ]
}